{"query": "My 6‑year‑old had a tonsillectomy yesterday and has a 38.3 °C fever. Is that normal?", "expected_answer": "A mild fever below 38.5 °C can occur in the first 48 hours after tonsil surgery. Offer fluids and rest, and recheck in a few hours. If the temperature reaches 39.0 °C or higher, or lasts more than 2 days, contact your provider."}
{"query": "She’s coughing a lot after RSV. How long can it last?", "expected_answer": "A cough can linger for 2–3 weeks after RSV. Focus on fluids and nasal saline before sleep. Seek care sooner for fast or hard breathing, blue lips, or poor feeding."}
{"query": "He keeps saying his arm itches under the cast. Can I slide something inside?", "expected_answer": "Avoid putting anything under the cast. Try gentle tapping on the outside and keep it dry. Call if there’s severe pain, numbness, or a bad smell."}
{"query": "My child missed two antibiotic doses today. What should I do?", "expected_answer": "Resume the medicine at the next scheduled time unless your provider advised otherwise. For specific catch‑up instructions, call your clinic or pharmacist."}
{"query": "Her ear still hurts after one day of antibiotics. Is that expected?", "expected_answer": "Ear pain can take 48–72 hours to improve after starting treatment. Continue the plan as prescribed and monitor fever. If pain or fever isn’t improving after 72 hours, contact the clinic."}
{"query": "He vomited twice in the last six hours—should I worry?", "expected_answer": "Repeated vomiting can cause dehydration. Offer small sips of oral rehydration solution. If vomiting continues or your child can’t keep fluids down, contact your provider."}
{"query": "My 8‑year‑old’s fever is 39.2 °C tonight.", "expected_answer": "That is a high temperature. Follow your after‑visit instructions and contact your care line. Seek urgent care if your child looks very unwell or has trouble breathing."}
{"query": "Is it okay if she doesn’t eat much with the flu?", "expected_answer": "Lower appetite is common during flu. Encourage fluids and simple foods as tolerated. Seek care for dehydration signs or breathing difficulties."}
{"query": "After appendectomy, when can he play sports again?", "expected_answer": "Light walking is encouraged. Avoid contact sports until your surgeon clears it—often after a follow‑up visit when healing is confirmed."}
{"query": "What should I watch for around the stitches?", "expected_answer": "Some redness right at the edges is normal. Watch for spreading redness, thick drainage, bad smell, or fever; contact your provider if these occur."}
{"query": "She’s still coughing after pneumonia treatment—normal?", "expected_answer": "Cough and tiredness can take 1–2 weeks to improve. Ensure antibiotics are taken as prescribed and encourage rest. If breathing worsens or fever rises after 48 hours, contact the clinic."}
{"query": "Can I give both ibuprofen and acetaminophen?", "expected_answer": "Only give medicines as directed by your child’s provider. Do not exceed labeled amounts or duplicate ingredients. If unsure, call your provider or pharmacist."}
